<template>
  <div class="study-contain">
    <div class="study-contain-head">学习</div>
    <div class="study-contain-body">
      <div class="title">{{ title }}模块</div>
      <div class="main-content">
        <div class="content">
          <ul v-for="(item, index) in content" :key="index">
            <li>{{ item }}</li>
          </ul>
        </div>
        <div class="mulu">
          <div class="mulu-title">学习主题</div>
          <div class="mulu-sub-title">{{ title }}</div>
        </div>
      </div>
      <div class="foot">
        <div style="margin-left:20px">
          <el-button type="primary" @click="toPractice">练习</el-button>
        </div>
        <div style="margin-right:20px">
          已有
          <span style="color: red; font-weight: bolder">500</span>
          人参与学习
        </div>
      </div>
    </div>
  </div>
</template>

<script setup>
import { onMounted, ref } from "vue";
import { useRouter, useRoute } from "vue-router";
const router = useRouter();

// 获取路由的携带的参数值
const route = useRoute();
const id = route.query.id;
const title = route.query.title;
const toPractice = () => {
  router.push({
    path: "/practice",
    query: {
      id: id,
    },
  });
};
// 具体内容
const content = ref();

onMounted(() => {
  // 获取具体内容
  if (title == "工地施工安全") {
    content.value = [
      "1.1	严格遵守安全操作规程，确保个人和他人安全，确保所有操作在防护措施下进行。",
      "1.2	高风险作业时，务必穿戴合适的防护用品，如安全帽、安全带、防护眼镜等。",
      "1.3	施工现场需标明明显的安全警示标志，并采取有效防护措施，防止无关人员进入。",
      "1.4	高处作业时务必系好安全带，并确保周围无杂物，避免物料意外坠落。",
      "1.5	使用机械设备时，要定期检查设备状况，确保设备处于良好工作状态。",
      "1.6	施工现场严禁吸烟，特别是在易燃易爆物品周围，防止火灾事故发生。",
      "1.7	施工前要对所有电气设备进行检查，确保电路绝缘良好，避免电击事故。",
      "1.8	进入施工现场必须穿戴符合标准的工作服、工鞋，确保操作安全。",
      "1.9	在高温或恶劣天气下作业时，确保采取相应的防护措施，防止中暑或其他事故。",
      "1.10	高处作业人员需定期体检，确保没有高血压、心脏病等不适合高空作业的疾病。",
      "1.11	起吊作业前，应计算物体的重量和重心，确保吊装作业的安全性。",
      "1.12	使用脚手架时要定期检查脚手架的稳定性和连接点，确保不会发生坍塌。",
      "1.13	工地应设立明显的出入口，并保持通畅，避免交通阻塞。",
      "1.14	在施工现场内，所有的工具和材料应妥善存放，避免出现绊倒或其他事故。",
      "1.15	严禁使用破损的工具和设备，必须定期检查和更换损坏的工具。",
      "1.16	建筑材料应有专门的存放区域，堆放时应确保整齐稳固，防止材料坍塌。",
      "1.17	电焊作业时，要佩戴合适的防护眼镜，并使用防火涂料保护周围环境。",
      "1.18	在施工现场，严禁随意丢弃垃圾或工具，保持现场清洁，减少安全隐患。",
      "1.19	对于特殊工种（如电工、焊工），必须经过专业培训并持有有效证书方可操作。",
      "1.20	对于可能出现高空坠物的工作区域，必须设置防护网和警示标志。",
      "1.21	在施工现场安装的设备必须符合安全标准，定期检查确保设备正常运行。",
      "1.22	施工人员在操作重型机械时，必须确保设备周围没有无关人员。",
      "1.23	使用梯子时，确保梯子稳固，底部有防滑装置，不得让人站立或骑坐。",
      "1.24	施工现场必须有明显的火灾报警标志，并配备完备的消防设备。",
      "1.25	在操作机械设备时，务必确保设备处于停止状态，防止发生意外启动。",
      "1.26	对施工现场所有电气线路进行合理布置，避免短路和电气火灾发生。",
      "1.27	严格按照规定存放易燃易爆物品，确保火源与危险品隔离。",
      "1.28	高空作业时，要使用合适的防护设备，如安全绳、安全带等，确保安全。",
      "1.29	使用脚手架时，所有连接件和安全装置必须完整无缺，不得随意拆除。",
      "1.30	进行焊接、切割等作业时，要采取必要的防火措施，确保周围无可燃物。",
      "1.31	高处作业时，要避免用力过猛，确保平衡，防止因失去平衡发生坠落。",
      "1.32	施工现场应定期清理，避免积水或垃圾堆积，确保工作环境安全。",
      "1.33	对于所有重物运输，要事先检查运输工具的稳定性，避免搬运过程中出现意外。",
      "1.34	使用电动工具时，务必确保工具线路正常，避免因电缆故障发生电击。",
      "1.35	施工现场严禁私自更改或移动防护设施，必须经过批准后方可拆除。",
      "1.36	高空作业人员在作业前，应检查平台的稳固性，并佩戴防护设备。",
      "1.37	高处作业时，必须确保周围区域无障碍物，以避免干扰操作。",
      "1.38	施工现场需保证有足够的照明，特别是在夜间作业时，确保安全。",
      "1.39	高风险作业区域应设置明显的警示标志，并进行专门的安全培训。",
      "1.40	在施工过程中，严格遵守现场的管理规定，确保个人安全。",
    ];
  }
  if (title == "施工现场安全防护用品") {
    content.value = [
      "2.1	安全帽用于保护头部免受坠落物或碰撞伤害。",
      "2.2	护目镜或面罩保护眼睛免受尘土、化学品或碎片的伤害。",
      "2.3	防护手套用于保护手部免受化学品、尖锐物或热物体的伤害。",
      "2.4	防护靴保护脚部免受坠物、尖锐物或化学品的伤害。",
      "2.5	防护服和工作服用于防护身体免受化学品、火灾或尖锐物的伤害。",
      "2.6	呼吸防护器具（口罩或面具）防止吸入有害气体、尘埃或颗粒物。",
      "2.7	吸尘器和除尘设备帮助清除施工现场的尘土，降低空气中的颗粒物浓度。",
      "2.8	安全警示标识如标牌、标志或警示带，用于指示危险区域或安全规定。",
      "2.9	紧急救援设备如急救箱、安全绳索和灭火器，用于处理突发的安全事件。",
      "2.10	工人必须穿戴结实的硬帽，以防止头部受伤。",
      "2.11	安全鞋需具备防滑、防穿刺功能，保护脚部免受伤害。",
      "2.12	在施工过程中，工人必须佩戴适合的安全眼镜，防止飞溅物体伤害眼睛。",
      "2.13	在噪音环境下，工人需佩戴耳塞或耳罩，防止听力受损。",
      "2.14	防护手套应根据工作任务选择，防止手部受伤或接触有害物质。",
      "2.15	工人在特定工种中需要使用口罩，避免吸入有害气体或尘埃。",
      "2.16	对于某些工作环境，工人应佩戴护目镜以避免眼部受伤。",
      "2.17	在噪音过大的工作环境下，工人应佩戴防护耳罩以防止听力受损。",
      "2.18	在特殊工作情况下，工人需使用呼吸器，保护呼吸系统。",
      "2.19	建筑工地管理者应提供高质量的安全防护用品，确保工人安全。",
      "2.20	工人应接受培训，掌握正确佩戴和使用安全防护服装与个人防护用品的方法。",
      "2.21	定期检查安全防护用品，确保其处于良好状态。",
      "2.22	工人应了解何时需要佩戴特定的防护用品，并如何正确使用。",
      "2.23	如果防护用品损坏或失效，应及时更换或修复。",
      "2.24	根据使用寿命，定期替换安全防护服装和个人防护用品，以保持其有效性。",
      "2.25	确保工人知道如何正确维护安全防护服装与个人防护用品。",
      "2.26	在进行高空作业时，工人必须佩戴合适的防护用品，如安全带。",
      "2.27	所有施工人员应遵守安全规定，佩戴必要的防护装备。",
      "2.28	工人应使用适当的工具和设备，避免因操作不当而引发的危险。",
      "2.29	在危险区域，必须设置明显的安全标识，提醒工人注意安全。",
      "2.30	建筑工地应配备紧急救援设备，并确保其随时可用。",
      "2.31	工人应避免在工作过程中私自移除或更改防护设施。",
      "2.32	安全设施和设备的使用应符合相关法律和行业标准。",
      "2.33	在施工过程中，必须提供必要的安全教育和培训，确保工人了解安全防护的重要性。",
      "2.34	应定期对工地的防护设备进行检查，确保其有效性。",
      "2.35	所有机械设备应配备适当的安全防护装置。",
      "2.36	在电气设备使用时，工人应佩戴适当的绝缘手套和防护眼镜。",
      "2.37	在施工作业中，应避免长时间暴露在有毒、有害物质中。",
      "2.38	高温环境下工作时，应佩戴防高温手套和耐热鞋。",
      "2.39	所有防护用品必须符合国家标准，并经过认证。",
      "2.40	在施工区域内使用机械设备时，应严格遵守安全操作规程。",
      "2.41	所有工地的防护设施必须经常检查，以确保其稳固性。",
      "2.42	在施工现场，禁止穿戴不符合安全要求的服装和鞋类。",
      "2.43	安全带、绳索等安全设备需经常检查，确保其未损坏或失效。",
      "2.44	工人应避免在危险的施工区域内饮食、吸烟或进行其他非工作活动。",
      "2.45	工地应提供足够的安全出口和疏散通道，以应对突发情况。",
      "2.46	使用电动工具时，必须佩戴必要的防护眼镜和耳罩。",
      "2.47	在施工现场使用化学品时，应佩戴防护口罩、手套和防护服。",
      "2.48	工地应定期进行安全演习，确保工人熟悉应急处理措施。",
      "2.49	在施工现场，应保证充足的照明和通风，以确保作业环境安全。",
      "2.50	工人应始终保持警觉，发现安全隐患时及时报告。",
    ];
  }
  if (title == "工地消防安全") {
    content.value = [
      "3.1	工地消防安全至关重要，因为工地常常存在易燃易爆物品，一旦发生火灾，后果严重。",
      "3.2	火灾不仅会造成人员伤亡和财产损失，还可能造成环境污染和社会恶劣影响。",
      "3.3	火灾在工地上可能引发爆炸、高温、烟雾等危险，威胁工人的生命安全。",
      "3.4	工地应配备足够数量的灭火器，并确保其处于正常工作状态。",
      "3.5	工人应接受灭火器使用培训，并根据火灾类型选择合适的灭火器。",
      "3.6	重要设施应安装自动灭火系统，工人需了解系统工作原理及使用方法。",
      "3.7	防烟排烟系统帮助清除火灾烟雾，工人应了解如何使用该系统。",
      "3.8	工地应设置合理的火灾逃生通道，确保通道畅通无阻。",
      "3.9	工人应熟悉火灾逃生通道的位置，并能迅速逃离危险区域。",
      "3.10	火灾逃生时，工人应保持冷静，尽量低姿态前进，避免吸入有毒烟雾。",
      "3.11	如果逃生通道被烟雾封堵，应寻找其他逃生通道或寻求救援。",
      "3.12	自救时，工人应使用湿毛巾捂住口鼻，减少吸入有毒烟雾。",
      "3.13	工人可以利用湿毛巾堵住门窗缝隙，防止烟雾进入室内。",
      "3.14	工地应严格控制火源，禁止在易燃易爆区域使用明火。",
      "3.15	电气设备应定期检查，防止电线老化或短路引发火灾。",
      "3.16	储存油漆、气瓶等危险物品时，应严格按照规定进行操作，避免火灾。",
      "3.17	工地电气设备应符合安全标准，并定期进行维护和检测。",
      "3.18	工人应注意用电安全，避免私拉乱接电线。",
      "3.19	工地应定期进行消防安全培训，提高工人的安全意识和应急处理能力。",
      "3.20	施工单位负责人应组织消防演练，确保消防设备和通道畅通。",
      "3.21	现场负责人应定期检查消防设施，确保其正常运转。",
      "3.22	火灾发生时，发现者应立即拨打火警电话并提供准确情况。",
      "3.23	在火灾扑灭过程中，工人应使用湿毛巾捂住口鼻，避免吸入有毒烟雾。",
      "3.24	防火墙是为了阻挡火势蔓延而设置的墙体，使用阻燃材料构建。",
      "3.25	防火门具有一定的阻燃时间，可以在火灾中起到隔离作用。",
      "3.26	消防通道应保持畅通，确保消防车辆和人员的通行。",
      "3.27	工地应配备灭火器，常见的灭火器有干粉、二氧化碳、泡沫等类型。",
      "3.28	工人应学习正确使用灭火器，如拉开安全销、拿稳喷嘴等。",
      "3.29	电气火灾常因违规操作电器设备导致，应定期检查电路和设备。",
      "3.30	焊接过程中应采取防护措施，使用通风设备防止烟雾积聚。",
      "3.31	工地应制定应急预案，明确疏散路径、标志等。",
      "3.32	定期进行疏散演练，以提高工人熟悉疏散路径的能力。",
      "3.33	初级灭火可以使用手提灭火器进行扑灭。",
      "3.34	当火势无法控制时，应立即拨打火警电话，等待专业消防人员的到来。",
      "3.35	通过张贴宣传海报和制作宣传视频，提高消防安全意识。",
      "3.36	定期组织消防安全培训，教授使用消防器材和操作灭火器的技能。",
      "3.37	建立消防安全奖惩制度，对表现优异的员工进行奖励，违规者予以惩罚。",
      "3.38	施工现场应定期检查并保持消防设施的完整性。",
      "3.39	防火设施的配置应符合相关法律法规和消防安全标准。",
      "3.40	火灾隐患排查要做到不留死角，及时消除安全隐患。",
      "3.41	火灾报警设施应定期检查，确保其正常运作。",
      "3.42	所有工人应接受消防安全培训，了解火灾预防和应急措施。",
      "3.43	灭火器应按类型和数量配置，并确保在关键区域易于获取。",
      "3.44	每个工人都应知道火灾时的紧急撤离程序和集合地点。",
      "3.45	施工现场需要为工人提供充分的消防器材，确保有足够的灭火能力。",
      "3.46	应急疏散演练要覆盖所有工人，确保其在火灾发生时能够快速反应。",
      "3.47	灭火器使用要遵循先灭火后撤离的原则，不宜与火灾搏斗过长时间。",
      "3.48	工人需定期进行消防知识测试，保持对消防安全知识的熟悉度。",
      "3.49	定期检查电线、照明设备，防止电气火灾的发生。",
      "3.50	为了防止火灾蔓延，施工现场应设有专门的消防水源和设备。",
    ];
  }
  if (title == "工地用电安全") {
    content.value = [
      "4.1	建筑施工现场的电工、电焊工需按规定培训，取得特种作业操作证。",
      "4.2	施工现场必须采用TN-S接零保护系统。",
      "4.3	施工现场必须按“三级配电二级保护”设置。",
      "4.4	每台设备必须有专用的开关箱，并设置独立隔离开关和漏电保护器。",
      "4.5	禁止在高压线下方搭建临建、堆放材料或施工作业。",
      "4.6	宿舍工棚、仓库内禁止使用大功率电器，需专业电工安装。",
      "4.7	严禁乱接电源，非电工不得更换保险丝。",
      "4.8	禁止在电线上晾衣物或挂其他物品。",
      "4.9	搬运金属物体时，注意避免碰触电线。",
      "4.10	在建筑物附近作业时，避免触摸或拉动电线。",
      "4.11	移动梯子或平台时，确保与电线保持足够距离。",
      "4.12	运送材料时，不得踩踏电线或压住电线。",
      "4.13	移动带电机械设备时，必须先切断电源。",
      "4.14	发现电线坠地或设备漏电时，保持安全距离。",
      "4.15	安全电压为50V以下的电压系列，常用的安全电压有12V、24V、36V。",
      "4.16	特殊场所照明电压应不大于36V。",
      "4.17	潮湿环境照明电压不应大于24V。",
      "4.18	在特别潮湿的场所，照明电压不得大于12V。",
      "4.19	识别电线的相色：火线、工作零线和保护零线。",
      "4.20	火线一般为黄色、绿色、红色，保护零线为黄绿双色。",
      "4.21	插座应选用“品字形”结构。",
      "4.22	插座安装时，接地孔应在顶部位置。",
      "4.23	插座接线时，左孔接零线，右孔接相线。",
      "4.24	不得在开关箱中放置杂物。",
      "4.25	电箱门应配锁，非电工人员不得乱接电线。",
      "4.26	电气线路采用三相五线制供电。",
      "4.27	架空线路必须使用绝缘铜线。",
      "4.28	导线与地面保持至少4m的安全距离。",
      "4.29	若无法保证安全距离，必须采取防护措施。",
      "4.30	设备外壳应采用保护接零并安装漏电保护器。",
      "4.31	配电箱应挂设安全警示牌。",
      "4.32	临时照明线路必须使用绝缘导线，且安装在离地2m以上。",
      "4.33	拉线开关应安装在离地2-3m高处。",
      "4.34	严禁在床头设置开关和插座。",
      "4.35	照明灯具的相线必须经过开关控制。",
      "4.36	手持照明灯具的电源电压应不超过36V。",
      "4.37	照明系统中的单相回路灯具和插座数量不应超过25个。",
      "4.38	每台用电设备必须有专用的开关箱。",
      "4.39	开关箱中必须设漏电保护器，额定漏电电流不大于30mA。",
      "4.40	配电箱和开关箱应安装在端正、牢固的位置。",
      "4.41	配电箱之间的距离不得超过30m。",
      "4.42	使用漏电保护器前应由电工检测，确保合格。",
      "4.43	漏电保护器发生跳闸时，不得强行合闸。",
      "4.44	施工现场的开关箱应防雨、防尘并加锁。",
      "4.45	开关箱内不得存放其他物品。",
      "4.46	开关箱周围应保持足够的操作空间。",
      "4.47	电气设备和线路的绝缘必须良好。",
      "4.48	使用橡皮线时应架空敷设，不得拖地使用。",
      "4.49	高压线下方不得搭设临建或堆放材料。",
      "4.50	施工现场的电动机械设备作业前应进行检查和试运转。",
    ];
  }
});
</script>

<style lang="scss" scoped>
.study-contain {
  margin: 0 auto;
  width: 80%;
  height: 100%;

  .study-contain-head {
    width: 300px;
    height: 60px;
    background-color: #df0a0b;
    font-size: 20px;
    font-weight: bolder;
    line-height: 60px;
    text-align: center;
    margin: 20px auto;
    color: white;
    border-radius: 10px;
  }

  .study-contain-body {
    width: 100%;
    height: 100%;
    background-color: #f4f4f4;
    border: 1px solid #f4f4f4;

    .title {
      width: 100%;
      height: 60px;
      font-size: 20px;
      font-weight: bolder;
      line-height: 60px;
      padding-left: 30px;
      color: #df0a0b;
    }

    .main-content {
      width: 100%;
      height: 100%;
      display: flex;
      justify-content: space-around;

      .content {
        width: 65%;
        height: 100%;
        background-color: white;
        padding: 10px 30px;
      }

      .mulu {
        background-color: white;
        text-align: center;
        width: 25%;
        height: 100%;

        .mulu-title {
          width: 100%;
          height: 60px;
          background-color: #df0a0b;
          font-size: 20px;
          font-weight: bolder;
          line-height: 60px;
          color: white;
        }

        .mulu-sub-title {
          width: 100%;
          height: 50px;
          font-size: 16px;
          line-height: 50px;
          text-align: left;
          padding-left: 30px;
        }
      }
    }

    .foot {
      margin-top: 10px;
      width: 100%;
      height: 60px;
      font-size: 20px;
      font-weight: lighter;
      line-height: 60px;
      text-align: center;
      display: flex;
      justify-content: space-between;

      .el-button {
        width: 100px;
        height: 40px;
        font-size: 16px;
        line-height: 40px;
      }
    }
  }
}
</style>